of-run/canal/canal2D/01-canal2DL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0) //0
    (44 0 0)  //1
    (0 7.5 0) //2  
    (44 7.5 0) //3
    (220 7.5 0) //4
    (0 32.5 0) //5
    (44 32.5 0) //6
    (220 32.5 0) //7
    (0 0 1) //8
    (44 0 1) //9
    (0 7.5 1) //10    
    (44 7.5 1) //11
    (220 7.5 1) //12
    (0 32.5 1) //13
    (44 32.5 1) //14
    (220 32.5 1) //15
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (35 6 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (35 20 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (141 20 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
	leftWall
    {
        type wall;
        faces
        (
            (0 8 10 2)
            (2 10 13 5)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (7 15 12 4)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 3 11 9)
            (3 4 12 11)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
